### Problem Statement : Hospital Patient Data Analysis

#### Context:

##### A hospital maintains patient records including admission details, department, diagnosis, doctor, and bill amount. You have two datasets: one with patient info and another with billing details. Some patients have blank bill amounts, and there are multiple rows for the same patient due to follow-ups.

##### 1) Load the patient dataset and show summary with info().

In [31]:
import pandas as pd
import numpy as np

In [32]:
df=pd.read_csv("Patient_Data.csv")

In [33]:
df.head()

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45

In [34]:
df.shape

(6, 7)

##### 2) Select only the columns relevant for billing: ['PatientID', 'Department', 'Doctor', 'BillAmount'].

In [35]:
df.columns

Index(['PatientID', 'Name', 'Department', 'Doctor', 'BillAmount',
       'ReceptionistID', 'CheckInTime'],
      dtype='object')

In [36]:
df_billing=df[['PatientID','Department','Doctor','BillAmount']]

In [37]:
df_billing

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN
5        101   Cardiology  Dr. Smith      5000.0

##### 3) Drop administrative columns like ['ReceptionistID', 'CheckInTime'].

In [38]:
df.drop(columns=['ReceptionistID','CheckInTime'],inplace=True)

In [39]:
df

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN
5        101    Alice   Cardiology  Dr. Smith      5000.0

##### 4) Use groupby to find total bill amount per department.

In [40]:
df.groupby('Department')['BillAmount'].sum()

Department
Cardiology     16200.0
Dermatology        0.0
Neurology          0.0
Orthopedics     7500.0
Name: BillAmount, dtype: float64

##### 5) Remove duplicate patient records based on PatientID.

In [41]:
df.duplicated().sum()

1

In [42]:
df[df.duplicated]

   PatientID   Name  Department     Doctor  BillAmount
5        101  Alice  Cardiology  Dr. Smith      5000.0

In [43]:
df.drop_duplicates(ignore_index=True,inplace=True)

In [44]:
df.duplicated().sum()

0

##### 6) Fill missing BillAmount values with the mean bill amount.

In [45]:
df.isnull().sum()

PatientID     0
Name          0
Department    0
Doctor        0
BillAmount    2
dtype: int64

In [46]:
df.fillna({'BillAmount':df.BillAmount.mean()},inplace=True)

In [47]:
df.isnull().sum()

PatientID     0
Name          0
Department    0
Doctor        0
BillAmount    0
dtype: int64

In [48]:
df

   PatientID     Name   Department     Doctor   BillAmount
0        101    Alice   Cardiology  Dr. Smith  5000.000000
1        102      Bob    Neurology   Dr. John  6233.333333
2        103  Charlie  Orthopedics    Dr. Lee  7500.000000
3        104    David   Cardiology  Dr. Smith  6200.000000
4        105      Eva  Dermatology   Dr. Rose  6233.333333

##### 7) Merge the billing dataset with patient dataset on PatientID.

In [49]:
df1=pd.read_csv("Billing_Data.csv")

In [51]:
df1.head()

   PatientID  InsuranceCovered  FinalAmount
0        101              2000         3000
1        102              1500         3500
2        103              2500         5000
3        104              3000         3200
4        105              1000         4000

In [52]:
df1.shape

(5, 3)

In [54]:
df_merge=df.merge(df1)
df_merge

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.000000,2000,3000
1,102,Bob,Neurology,Dr. John,6233.333333,1500,3500
2,103,Charlie,Orthopedics,Dr. Lee,7500.000000,2500,5000
3,104,David,Cardiology,Dr. Smith,6200.000000,3000,3200
4,105,Eva,Dermatology,Dr. Rose,6233.333333,1000,4000

##### 8) Concatenate an additional DataFrame that contains new patients for the current week (row-wise).

In [58]:
dict_row={'PatientID':[106,107,108],'Name':['Aswin','Athul','Abhishek'],'Department':['CSE','ME','ECE'],
          'Doctor':['Dr. Vishwas','Dr. Karen','Dr. David'],'BillAmount':[5667,10000,7600],
          'InsuranceCovered':[1000,500,2000],'FinalAmount':[4667,9500,5600]}

In [59]:
df_row=pd.DataFrame(dict_row)
df_row

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,106,Aswin,CSE,Dr. Vishwas,5667,1000,4667
1,107,Athul,ME,Dr. Karen,10000,500,9500
2,108,Abhishek,ECE,Dr. David,7600,2000,5600

In [62]:
df_conc1=pd.concat([df_merge,df_row],ignore_index=True)
df_conc1

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.000000,2000,3000
1,102,Bob,Neurology,Dr. John,6233.333333,1500,3500
2,103,Charlie,Orthopedics,Dr. Lee,7500.000000,2500,5000
3,104,David,Cardiology,Dr. Smith,6200.000000,3000,3200
4,105,Eva,Dermatology,Dr. Rose,6233.333333,1000,4000
5,106,Aswin,CSE,Dr. Vishwas,5667.000000,1000,4667
6,107,Athul,ME,Dr. Karen,10000.000000,500,9500
7,108,Abhishek,ECE,Dr. David,7600.000000,2000,5600

##### 9) Concatenate new billing category columns like ['InsuranceCovered', 'FinalAmount'] (column-wise).

In [63]:
dict_col={'MedicalCharges':[500,1000,1500,800,900,1200,1100,1000],
          'RoomCharges':[2000,2500,1500,2300,1700,1800,2600,4000]}

In [65]:
df_col=pd.DataFrame(dict_col)
df_col

   MedicalCharges  RoomCharges
0             500         2000
1            1000         2500
2            1500         1500
3             800         2300
4             900         1700
5            1200         1800
6            1100         2600
7            1000         4000

In [ ]:
df_conc2=pd.concat(df_conc1,